; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_5)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 - link
    angle0 angle20 angle40 angle60 angle80 angle100 angle120 angle140 angle160 angle180 angle200 angle220 angle240 angle260 angle280 angle300 angle320 angle340 - angle)
(:init
    (AngleOrd angle0 angle20)
    (AngleOrd angle20 angle40)
    (AngleOrd angle40 angle60)
    (AngleOrd angle60 angle80)
    (AngleOrd angle80 angle100)
    (AngleOrd angle100 angle120)
    (AngleOrd angle120 angle140)
    (AngleOrd angle140 angle160)
    (AngleOrd angle160 angle180)
    (AngleOrd angle180 angle200)
    (AngleOrd angle200 angle220)
    (AngleOrd angle220 angle240)
    (AngleOrd angle240 angle260)
    (AngleOrd angle260 angle280)
    (AngleOrd angle280 angle300)
    (AngleOrd angle300 angle320)
    (AngleOrd angle320 angle340)
    (AngleOrd angle340 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)

    (HasAngle angle40 link1)
    (HasAngle angle220 link2)
    (HasAngle angle240 link3)
    (HasAngle angle260 link4)
)
(:goal
(and
    (HasAngle angle100 link1)
    (HasAngle angle320 link2)
    (HasAngle angle220 link3)
    (HasAngle angle320 link4)
    )
)
)

; plan
1. (increase_angle link1 angle40 angle60)
   deleted: (hasangle angle40 link1) (hasangle angle220 link2) (hasangle angle240 link3) (hasangle angle260 link4)
   added: (hasangle angle60 link1) (hasangle angle240 link2) (hasangle angle260 link3) (hasangle angle280 link4)
   goals met: 0 of 4
2. (increase_angle link1 angle60 angle80)
   deleted: (hasangle angle60 link1) (hasangle angle240 link2) (hasangle angle260 link3) (hasangle angle280 link4)
   added: (hasangle angle80 link1) (hasangle angle260 link2) (hasangle angle280 link3) (hasangle angle300 link4)
   goals met: 0 of 4
3. (increase_angle link1 angle80 angle100)
   deleted: (hasangle angle80 link1) (hasangle angle260 link2) (hasangle angle280 link3) (hasangle angle300 link4)
   added: (hasangle angle100 link1) (hasangle angle280 link2) (hasangle angle300 link3) (hasangle angle320 link4)
   goals met: 2 of 4
4. (increase_angle link2 angle280 angle300)
   deleted: (hasangle angle280 link2) (hasangle angle300 link3) (hasangle angle320 link4)
   added: (hasangle angle300 link2) (hasangle angle320 link3) (hasangle angle340 link4)
   goals met: 1 of 4
5. (increase_angle link2 angle300 angle320)
   deleted: (hasangle angle300 link2) (hasangle angle320 link3) (hasangle angle340 link4)
   added: (hasangle angle320 link2) (hasangle angle340 link3) (hasangle angle0 link4)
   goals met: 2 of 4
6. (decrease_angle link3 angle340 angle320)
   deleted: (hasangle angle340 link3) (hasangle angle0 link4)
   added: (hasangle angle320 link3) (hasangle angle340 link4)
   goals met: 2 of 4
7. (decrease_angle link3 angle320 angle300)
   deleted: (hasangle angle320 link3) (hasangle angle340 link4)
   added: (hasangle angle300 link3) (hasangle angle320 link4)
   goals met: 3 of 4
8. (decrease_angle link3 angle300 angle280)
   deleted: (hasangle angle300 link3) (hasangle angle320 link4)
   added: (hasangle angle280 link3) (hasangle angle300 link4)
   goals met: 2 of 4
9. (decrease_angle link3 angle280 angle260)
   deleted: (hasangle angle280 link3) (hasangle angle300 link4)
   added: (hasangle angle260 link3) (hasangle angle280 link4)
   goals met: 2 of 4
10. (decrease_angle link3 angle260 angle240)
   deleted: (hasangle angle260 link3) (hasangle angle280 link4)
   added: (hasangle angle240 link3) (hasangle angle260 link4)
   goals met: 2 of 4
11. (decrease_angle link3 angle240 angle220)
   deleted: (hasangle angle240 link3) (hasangle angle260 link4)
   added: (hasangle angle220 link3) (hasangle angle240 link4)
   goals met: 3 of 4
12. (increase_angle link4 angle240 angle260)
   deleted: (hasangle angle240 link4)
   added: (hasangle angle260 link4)
   goals met: 3 of 4
13. (increase_angle link4 angle260 angle280)
   deleted: (hasangle angle260 link4)
   added: (hasangle angle280 link4)
   goals met: 3 of 4
14. (increase_angle link4 angle280 angle300)
   deleted: (hasangle angle280 link4)
   added: (hasangle angle300 link4)
   goals met: 3 of 4
15. (increase_angle link4 angle300 angle320)
   deleted: (hasangle angle300 link4)
   added: (hasangle angle320 link4)
   goals met: 4 of 4
